app/controllers/batches_controller.rb

  def index
    @batches = Batch.all.order(:created_at => :desc)
---
SELECT "batches".* FROM "batches" ORDER BY "batches"."created_at" DESC

  def create
    if @batch = Batch.create!(batch_params)
---
INSERT INTO "batches" ("csv_original_file_name", "csv_original_content_type", "csv_original_file_size", "csv_original_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def test_label
    line_item = Batch.first.line_items_for_printing.first
---
SELECT  "batches".* FROM "batches" ORDER BY "batches"."id" ASC LIMIT ?  [["LIMIT", 1]]